import React, { useState } from "react";

const jokes = [
  "पत्नी – तुम मुझे सोने के कंगन कब दोगे?\nपति – जब तुम मुझे सोने दोगी!",
  "टीचर – ईमानदारी का इनाम क्या होता है?\nगोलू – सर, ईमानदारी का इनाम अक्सर धोखा होता है!",
  "डॉक्टर – ज्यादा सोचने से इंसान पागल हो जाता है।\nगोलू – फिर तो मैं सरकारी नौकरी के लायक हो गया!",
  "शादी के बाद पहली बार खाना बनाकर पत्नी ने पति से पूछा – कैसा बना है?\nपति – कसम से, दिल गार्डन-गार्डन हो गया… लेकिन पेट कब्रिस्तान-कब्रिस्तान लग रहा है!",
  "संता – भाई शादी कर लूँ?\nबंता – कर ले, रात को भूतों से डर नहीं लगेगा।\nसंता – क्यों?\nबंता – क्योंकि घर में ही एक भूतनी होगी!",
  "पापा – बेटा, तुम सिगरेट क्यों पीते हो?\nबेटा – ओह पापा, जिंदगी में टेंशन बहुत है…\nपापा – ओह, तो फिर शादी कर ले… तेरा टेंशन भी डबल हो जाएगा!",
  "गोलू – मम्मी, मैं स्कूल नहीं जाऊँगा।\nमम्मी – क्यों?\nगोलू – टीचर कहती है, पढ़ने-लिखने की कोई उम्र नहीं होती, जब मन करे तब पढ़ लेना!",
];

const LaughComponent = () => {
  const [joke, setJoke] = useState(jokes[Math.floor(Math.random() * jokes.length)]);

  const getNewJoke = () => {
    setJoke(jokes[Math.floor(Math.random() * jokes.length)]);
  };

  return (
    <div className="m-2 p-3">
        <p className="text-lg text-white-700 whitespace-pre-line">{joke}</p>
    </div>
  );
};

export default LaughComponent;
